{
    "social": [
        { "name": "portfolio", "link": "https://penajoia.com/", "icon": "arrowCircleLeft" },
        { "name": "linkedin", "link": "https://www.linkedin.com/in/mpenajoia/", "icon": "linkedin" },
        { "name": "github", "link": "https://github.com/mpenajoia", "icon": "github" }
    ],
    "header": {
        "name": "Marco Silva",
        "title": "Software Engineer",
        "location": "Los Angeles, CA",
        "image": ""
    },
    "profile": "A results-oriented, adaptive, and multi-faceted Software Engineer with a record of success designing, building, and configuring applications to meet business processes and client requirements. Growth-focused thought leader with experience directing and developing effective teams by translating technical requirements, supporting all facets of software development life cycle, and guiding junior team members. Exceptionally dedicated professional with keen interpersonal, communication, and organizational skills.",
    "tech": {
        "title": "Tech Stack",
        "tech": [ 
            { 
                "type": "Frontend",
                "list": ["Javascript", "React", "TypeScript", "HTML", "CSS", "Tailwind"] 
            },
            { 
                "type": "Backend",
                "list": ["Node JS", "Python", "PHP", "SQLite", "REST API"] 
            },
            { 
                "type": "AWS",
                "list": ["Lambda", "API Gateway", "WAF", "Secrets Manager", "IAM", "CloudWatch", "S3", "EC2"] 
            },
            {
                 "type": "Tools",
                 "list": ["Webpack", "Git", "Github", "Jenkins", "Jira", "Figma", "Notion", "Monday"] 
                },
            {
                 "type": "Other",
                 "list": [ "Postman", "Photoshop", "Adobe Creative Suite", "Google Suite", "Zoom"] 
                },
            {
                "type": "Languages",
                "list": [ "English", "Portuguese", "Spanish"] 
                }
        ]
    },
    "projects": {
        "title": "Applications",
        "apps": [
            {
                "title": "Portfolio",
                "link": "https://penajoia.com/",
                "github": "https://github.com/mpenajoia/portfolio",
                "points": [
                    "Mobile responsive React app portfolio using TailwindCSS.",
                    "Local JSON file acts as an API making updating the content as easy as updating one file as opposed to each component."
                ]
            },
            {
                "title": "Resume Builder",
                "link": "https://penajoia.com/resume",
                "github": "https://github.com/mpenajoia/resume-page",
                "points": [
                    "Mobile responsive creative online web version of my professional resume styled using TailwindCSS.",
                    "React app sourcing all data from a local JSON file, making it extremely useful for other devs to replicate their own deployable version."
                ]
            },
            {
                "title": "cryptoFOMO",
                "link": "https://penajoia.com/cryptoFOMO/",
                "github": "https://github.com/mpenajoia/cryptofomo",
                "points": [
                    "Developed mobile first React financial web application styled with TailwindCSS.",
                    "Cryptocurrency data, images, and pricing sourced through CoinGecko's public RESTful API.",
                    "Applied logic based algorithms to calculate gains/losses per user inputted investment amount."
                ]
            }
        ]
    },
    "experience": {
        "title": "Experience and Impact",
        "employment": [
            {
                "company": "JW Player",
                "location": "Remote",
                "position": "Software Engineer",
                "time": "10/2022 - Present",
                "description": [
                    
                ],
                "points": [
                    "Leverage cross-functional collaboration with Solutions Engineers, Solutions Architects, and Project Managers to execute scalable and high-performance software solutions to meet global client base requirements; utilize JW platform and APIs for bespoke integrations and specialized plugins",
                    "Conduct test cases, design the architecture, write the code, and perform debugging to ensure applications are scalable and maintainable; craft adaptable software via frontend and backend tech reinforced by AWS cloud infrastructure",
                    "Investigate the prospective labor expenses and technical project scope to support Professional Services team operations; contribute directly to advancing JW SASS product across every phase of the software development life cycle",
                    "Produce project specifications and draft timeline to achieve operational feasibility; devise software components that fit functionally in system architecture",
                    "Document and maintain discrepancies in software functionality; troubleshoot, debug, and upgrade existing systems to adapt to changes in project specifications"
                ]
            },
            {
                "company": "Tech Fleet",
                "location": "Remote",
                "position": "Lead Developer",
                "time": "08/2022 - 11/2022",
                "description": [
                    
                ],
                "points": [
                    "Integrated Agile methodologies, Git Version Control, and other project management strategies to orchestrate productive team operations; reached project milestones on a consistent basis",
                    "Scheduled and led interviews to verify and recruit qualified candidates; provided mentoring as required on latest blockchain and cryptocurrency expertise",
                    "Guided and mentored development teams to guarantee efficient code development and adherence to coding standards",
                    "Applied knowledge in software architecture and development methodologies to devise a maintainable and scalable application"
                ]
            },{
                "company": "EarlyBird",
                "location": "Remote",
                "position": "Front End Intern",
                "time": "06/2022 - 08/2022",
                "description": [
                    
                ],
                "points": [
                    "Partnered with Product and Design teams on separate project timelines via Jira to write, test, debug, and deploy code suitable for production phase",
                    "Utilized React Native to incorporate brand awareness strategies, including a brand design digital overhaul on iOS and Android applications",
                    "Operated as Design Lead for executing copy and design decisions that were in alignment with overall team objective and company vision"
                ]
            },
            {
                "company": "Various",
                "location": "CA & NJ",
                "position": "Motorcycle Technician",
                "time": "06/2015 - 08/2021",
                "description": [
                    
                ],
                "points": [
                    "Delivered on all technical document assessment tasks; incorporated process streamlining to enhance overall workflow, resulting in heightened on-time productivity",
                    "Identified and overcame obstacles proactively to prevent breakdown from mechanical faults; drove a 20% boost by improving output capacity",
                    "Overhauled areas selected for specialization to advance workplace efficiency; completed all serviceable tasks from minor maintenance repairs to motor reconstruction for a range of motorcycle brands"
                ]
            },
            {
                "company": "Freelance",
                "location": "NYC",
                "position": "First Assistant Camera",
                "time": "01/2013 - 12/2015",
                "description": [
                    
                ],
                "points": [
                    "Managed camera department on domestic and international contracts with teams ranging from 5 to 20 teammates",
                    "Influenced equipment packages for optimal outcomes per project requirements and budget"
                ]
            },
            {
                "company": "SHI International Corp",
                "location": "Somerset, NJ",
                "position": "Operations Specialist",
                "time": "04/2014 - 05/2015",
                "description": [
                    
                ],
                "points": [
                    "Promoted within one year due to a proven track record",
                    "Produced results under expedited deadlines while adapting quickly to process changes"
                ]
            }
        ]
    },
    "additional": {
        "title": "Additional Experience",
        "other": [
            {
                "position": "First Assistant Camera",
                "company": "Freelance",
                "location": "New York, NY"
            },
            {
                "position": "Operations Specialist",
                "company": "SHI International Corporation",
                "location": "Somerset, NJ"
            }
        ]
    },
    "extra": {
        "title": "Education & Certifications",
        "credentials": [
            {
                "degree": "Bachelor of Business",
                "school": "New Jersey Institute of Technology",
                "location": "Newark, NJ"
            },
            {
                "degree": "Software Engineering Certification",
                "school": "General Assembly",
                "location": "Los Angeles, CA (Remote)"
            }
        ]
    },
    "skills": {
        "title": "Languages",
        "skill": [
            {
                "title": "English",
                "misc": "Native"
            },
            {
                "title": "Portuguese",
                "misc": "Fluent"
            },
            {
                "title": "Spanish",
                "misc": "Intermediate"
            }
        ]
    },
    "resume": "https://docs.google.com/document/d/1MXnyv1YNhR9ctm9yEPJ2Q31_4M7Sh-T8Oxl96XVw6zk/edit?usp=sharing"
}
